lib/tasks/dev.rake

SELECT "minings".* FROM "minings"
INSERT INTO "coins" ("coin_name", "acronym", "url_image", "created_at", "updated_at", "mining_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  task coin: :environment do
    show_spinner("cadastro moedas") do
      coins = [
        {
          coin_name:"Bitcoin", acronym:"BTC",
          url_image:"https://crypto.com/price/_next/image.png?url=https%3A%2F%2Fstatic.crypto.com%2Ftoken%2Ficons%2Fbitcoin%2Fcolor_icon.png&w=32&q=75",
          mining: Mining.all.sample
          # ou mining: Mining.find_by(acronym: 'PoW')
        }, {
          coin_name:"Ethereum", acronym:"ETH",
          url_image:"https://crypto.com/price/_next/image.png?url=https%3A%2F%2Fstatic.crypto.com%2Ftoken%2Ficons%2Fethereum%2Fcolor_icon.png&w=32&q=75",
          mining: Mining.all.sample
        }, {
          coin_name:"Binance Coin", acronym:"BNB",
          url_image:"https://crypto.com/price/_next/image.png?url=https%3A%2F%2Fstatic.crypto.com%2Ftoken%2Ficons%2Fbinance-coin%2Fcolor_icon.png&w=32&q=75",
          mining: Mining.all.sample
        }, {
          coin_name:"Tether", acronym:"USDT",
          url_image:"https://crypto.com/price/_next/image.png?url=https%3A%2F%2Fstatic.crypto.com%2Ftoken%2Ficons%2Ftether%2Fcolor_icon.png&w=32&q=75",
          mining: Mining.all.sample
        }, {
          coin_name:"Solana", acronym:"SOL",
          url_image:"https://crypto.com/price/_next/image.png?url=https%3A%2F%2Fstatic.crypto.com%2Ftoken%2Ficons%2Fsolana%2Fcolor_icon.png&w=32&q=75",
          mining: Mining.all.sample
        }, {
          coin_name:"Cardano", acronym:"ADA",
          url_image:"https://crypto.com/price/_next/image.png?url=https%3A%2F%2Fstatic.crypto.com%2Ftoken%2Ficons%2Fcardano%2Fcolor_icon.png&w=32&q=75",
          mining: Mining.all.sample
        }, {
          coin_name:"USD Coin", acronym:"USDC",
          url_image:"https://crypto.com/price/_next/image.png?url=https%3A%2F%2Fstatic.crypto.com%2Ftoken%2Ficons%2Fusd-coin%2Fcolor_icon.png&w=32&q=75",
          mining: Mining.all.sample
        }, {
          coin_name:"Axie Infinity", acronym:"AXS",
          url_image:"https://crypto.com/price/_next/image.png?url=https%3A%2F%2Fstatic.crypto.com%2Ftoken%2Ficons%2Faxie-infinity%2Fcolor_icon.png&w=32&q=75",
          mining: Mining.all.sample
        }, {
          coin_name:"Algorand", acronym:"ALGO",
          url_image:"https://crypto.com/price/_next/image.png?url=https%3A%2F%2Fstatic.crypto.com%2Ftoken%2Ficons%2Falgorand%2Fcolor_icon.png&w=48&q=75",
          mining: Mining.all.sample
        }
      ]
      # Same each do
      coins.each { |c| Coin.find_or_create_by!(c) }

INSERT INTO "minings" ("description", "acronym", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "Proof of Work"], ["acronym", "PoW"], ["created_at", "2021-12-07 19:57:43.938230"], ["updated_at", "2021-12-07 19:57:43.938230"]]
---
  task mining: :environment do
    show_spinner( "Cadastro tipo mineracao") do
      minings = [
        {description: "Proof of Work", acronym: "PoW"},
        {description: "Proof of Stake", acronym: "PoS"},
        {description: "Proof of Capacity", acronym: "PoC"}
      ]
      minings.each { |m| Mining.find_or_create_by!(m) }