app/controllers/coins_controller.rb

INSERT INTO "coins" ("coin_name", "acronym", "url_image", "created_at", "updated_at", "mining_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @coin = Coin.new(coin_params)
    respond_to do |format|
      if @coin.save
        format.html { redirect_to @coin, notice: (t'notice_coin.create') }

UPDATE "coins" SET "updated_at" = $1, "mining_id" = $2 WHERE "coins"."id" = $3  [["updated_at", "2021-12-09 14:42:24.124370"], ["mining_id", 1], ["id", 20]]
---
  def update
    respond_to do |format|
      if @coin.update(coin_params)

DELETE FROM "coins" WHERE "coins"."id" = $1  [["id", 15]]
DELETE FROM "coins" WHERE "coins"."id" = $1  [["id", 9]]
---
  def destroy
    @coin.destroy
    respond_to do |format|
      format.html { redirect_to coins_url, notice: (t'notice_coin.destroy') }

SELECT "coins".* FROM "coins" WHERE "coins"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT "coins".* FROM "coins" WHERE "coins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "minings".* FROM "minings" WHERE "minings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_coin
      @coin = Coin.find(params[:id])
      @mining = Coin.find(params[:id]).mining.description

SELECT "minings"."description", "minings"."id" FROM "minings"
---
  def set_mining_type
    @mining_type = Mining.all.pluck(:description, :id)