app/controllers/minings_controller.rb

  def index
    @minings = Mining.all
---
SELECT "minings".* FROM "minings"

  def create
    @mining = Mining.new(mining_params)

    respond_to do |format|
      if @mining.save
---
INSERT INTO "minings" ("description", "acronym", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", " Proof of alex"], ["acronym", "poa"], ["created_at", "2021-12-08 23:48:19.423623"], ["updated_at", "2021-12-08 23:48:19.423623"]]

  def update
    respond_to do |format|
      if @mining.update(mining_params)
---
UPDATE "minings" SET "acronym" = $1, "updated_at" = $2 WHERE "minings"."id" = $3  [["acronym", ""], ["updated_at", "2021-12-10 12:38:05.986814"], ["id", 1]]

  def destroy
    @mining.destroy
---
DELETE FROM "minings" WHERE "minings"."id" = $1  [["id", 3]]

  def set_mining
    @mining = Mining.find(params[:id])
    @coin = Mining.find(params[:id]).coin.coin_name
---
SELECT "minings".* FROM "minings" WHERE "minings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "coins".* FROM "coins" WHERE "coins"."mining_id" = $1  [["mining_id", 5]]

  def set_coins_used
    @coins_used_here = Coin.all.map(&:coin_name)
---
SELECT "coins".* FROM "coins"